Revit 2026 API

# RebarInSystemGetMovedBarTransform Method

---

Returns a transform representing the movement of the bar relative to its default position along the distribution path.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetMovedBarTransform(
	int barPositionIndex
)
```
```vb
Public Function GetMovedBarTransform (
	barPositionIndex As Integer
) As Transform
```
```cpp
public:
Transform^ GetMovedBarTransform(
	int barPositionIndex
)
```
```fsharp
member GetMovedBarTransform :
        barPositionIndex : int -> Transform
```

#### Parameters

barPositionIndex Int32
     The bar index.

#### Return Value

Transform The transform representing the movement of the bar relative to its default position along the distribution path.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |

For a RebarInSystem for which individual bars can't be edited (the ones owned by AreaReinforcement) the identity transform is returned.

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace